prusa3d/Prusa-Firmware-Buddy/lib/CycloneTCP/drivers/mac/esp32_eth_driver.c
   //Configure the second unicast address filter
   if(j >= 2)
   {
      REG_WRITE(EMAC_ADDR2HIGH_REG, unicastMacAddr[1].w[2] | EMAC_ADDRESS_ENABLE2_M);
      REG_WRITE(EMAC_ADDR2LOW_REG, unicastMacAddr[1].w[0] | (unicastMacAddr[1].w[1] << 16));
   }
   else
   {
      REG_WRITE(EMAC_ADDR2HIGH_REG, 0);
      REG_WRITE(EMAC_ADDR2LOW_REG, 0);
   }

   //Configure the third unicast address filter
   if(j >= 3)
   {
      REG_WRITE(EMAC_ADDR3HIGH_REG, unicastMacAddr[2].w[2] | EMAC_ADDRESS_ENABLE3_M);
      REG_WRITE(EMAC_ADDR3LOW_REG, unicastMacAddr[2].w[0] | (unicastMacAddr[0].w[2] << 16));
   }
   else
   {
      REG_WRITE(EMAC_ADDR3HIGH_REG, 0);
      REG_WRITE(EMAC_ADDR3LOW_REG, 0);
   }

   //Enable the reception of multicast frames if necessary
   if(acceptMulticast)
   {
      REG_SET_BIT(EMAC_GMACFF_REG, EMAC_PAM);
   }
   else
   {
      REG_CLR_BIT(EMAC_GMACFF_REG, EMAC_PAM);
   }

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Adjust MAC configuration parameters for proper operation
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t esp32EthUpdateMacConfig(NetInterface *interface)
{
   uint32_t config;

   //Read current MAC configuration
   config = REG_READ(EMAC_GMACCONFIG_REG);

   //10BASE-T or 100BASE-TX operation mode?
   if(interface->linkSpeed == NIC_LINK_SPEED_100MBPS)
   {
      config |= EMAC_EMACFESPEED_M;
   }
   else
   {
      config &= ~EMAC_EMACFESPEED_M;
   }

   //Half-duplex or full-duplex mode?
   if(interface->duplexMode == NIC_FULL_DUPLEX_MODE)
   {
      config |= EMAC_EMACDUPLEX_M;
   }
   else
   {
      config &= ~EMAC_EMACDUPLEX_M;
   }

   //Update MAC configuration register
   REG_WRITE(EMAC_GMACCONFIG_REG, config);

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Write PHY register
 * @param[in] opcode Access type (2 bits)
 * @param[in] phyAddr PHY address (5 bits)
 * @param[in] regAddr Register address (5 bits)
 * @param[in] data Register value
 **/

void esp32EthWritePhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr, uint16_t data)
{
   uint32_t temp;

   //Valid opcode?
   if(opcode == SMI_OPCODE_WRITE)
   {
      //Take care not to alter MDC clock configuration
      temp = REG_READ(EMAC_GMIIADDR_REG) & EMAC_MIICSRCLK_M;
      //Set up a write operation
      temp |= EMAC_MIIWRITE_M | EMAC_MIIBUSY_M;
      //PHY address
      temp |= (phyAddr << EMAC_MIIDEV_S) & EMAC_MIIDEV_M;
      //Register address
      temp |= (regAddr << EMAC_MIIREG_S) & EMAC_MIIREG_M;

      //Data to be written in the PHY register
      REG_WRITE(EMAC_MIIDATA_REG, data);

      //Start a write operation
      REG_WRITE(EMAC_GMIIADDR_REG, temp);
      //Wait for the write to complete
      while(REG_GET_BIT(EMAC_GMIIADDR_REG, EMAC_MIIBUSY))
      {
      }
   }
   else
   {
      //The MAC peripheral only supports standard Clause 22 opcodes
   }
}


/**
 * @brief Read PHY register
 * @param[in] opcode Access type (2 bits)
 * @param[in] phyAddr PHY address (5 bits)
 * @param[in] regAddr Register address (5 bits)
 * @return Register value
 **/

uint16_t esp32EthReadPhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr)
{
   uint16_t data;
   uint32_t temp;

   //Valid opcode?
   if(opcode == SMI_OPCODE_READ)
   {
      //Take care not to alter MDC clock configuration
      temp = REG_READ(EMAC_GMIIADDR_REG) & EMAC_MIICSRCLK_M;
      //Set up a read operation
      temp |= EMAC_MIIBUSY_M;
      //PHY address
      temp |= (phyAddr << EMAC_MIIDEV_S) & EMAC_MIIDEV_M;
      //Register address
      temp |= (regAddr << EMAC_MIIREG_S) & EMAC_MIIREG_M;

      //Start a read operation
      REG_WRITE(EMAC_GMIIADDR_REG, temp);
      //Wait for the read to complete
      while(REG_GET_BIT(EMAC_GMIIADDR_REG, EMAC_MIIBUSY))
      {
      }

      //Get register value
      data = REG_READ(EMAC_MIIDATA_REG);
   }
   else
   {
      //The MAC peripheral only supports standard Clause 22 opcodes
      data = 0;
   }

   //Return the value of the PHY register
   return data;
}
